# CLI tools
brew "node"
brew "crunch"
brew "heroku/brew/heroku"
brew "ffmpeg"
brew "gcc"
brew "cocoapods"
brew "tesseract"
brew "imagemagick"
brew "mas"
brew "nmap"
brew "jq"
brew "yt-dlp"
brew "mongosh"
brew "rclone"
brew "swiftgen"
brew "swiftlint"

# Apps
#cask "firefox"
cask "visual-studio-code"
cask "zoom"
cask "1password"
cask "iterm2"
cask "docker"
cask "daisydisk"
cask "postman"
cask "iina"
cask "obs"

# Mac AppStore apps (Requires to login to Appstore)
mas "iMovie", id: 408981434
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "WhatsApp", id: 310633997
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Windows App", id: 1295203466
mas "DevCleaner", id: 1518425042
mas "RunCat", id: 1429033973
mas "The Unarchiver", id: 425424353

# VSCode extensions
vscode "vscode-icons-team.vscode-icons"
